<a href="https://colab.research.google.com/github/leobioinf0/233_Introduccion_a_la_ciencia_de_datos/blob/main/4_2_INDEXAR_SELECCIONAR_Y_FILTRAR.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#4.2 INDEXAR, SELECCIONAR Y FILTRAR  

Seguimos avanzando y profundizando en las bases de datos.  

A continuación, crea un nuevo proyecto con Jupyter Notebook y descárgate esta base de  datos desde este enlace. Guárdala en la misma carpeta donde tienes el proyecto nuevo.  
Primero, cargamos la librería Pandas y le asignamos el nombre pd:

In [ ]:
import pandas as pd 

#Importamos la base de datos y la guardamos en una variable denominada data_base.  Después, vemos las cinco primeras observaciones: 

data_base = pd.read_csv('insurance.csv') 
data_base.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

Entonces, nos aparecen todas las columnas con sus cinco primeras observaciones, pero no  sabemos cómo es de grande esta base de datos. Si queremos imprimir solo un determinado  número de filas, pero queremos, además, ver el número total de filas, lo tendremos que hacer  así:

In [ ]:
pd.set_option("display.max_rows", 10) 
data_base

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

  
Aquí, nos aparecen los títulos de las columnas y cuatro filas con sus datos. Debajo de la  tabla, vemos que está formada por 1.338 filas (observaciones) y 7 columnas (atributos o  variables).

Si queremos específicamente la información que contiene una variable determinada, solo  tendremos que introducir este código:

In [ ]:
data_base['region']

0       southwest
1       southeast
2       southeast
3       northwest
4       northwest
          ...
1333    northwest
1334    northeast
1335    southeast
1336    southwest
1337    northwest
Name: region, Length: 1338, dtype: object

Ahora, vemos solo información correspondiente a la variable region.  

Si quieres ver más observaciones, tendrás que cambiar el parámetro de la función  set_option(). En vez de cinco, puedes poner diez. Si haces el cambio, tendrás que volver a  ejecutar los códigos, para ver más filas en la base de datos. 

Nota: tú puedes escoger otra variable, como puede ser smoker, sex, age, etc. 

Supongamos, ahora, que quieres saber el valor más grande que tiene la columna bmi. Esto lo  puedes saber, llamando la función describe(). ¿Te acuerdas? O bien seleccionando solo la  columna bmi y haciendo uso de la función max():

In [ ]:
data_base['bmi'].max()

53.13

En ambos casos, el resultado es 53,13. 

Y ¿cómo lo podemos hacer para seleccionar solo los 30 primeros valores de una columna?  Pues así:

In [ ]:
bmi_30 = data_base['bmi'][0:30] 
bmi_30

0     27.900
1     33.770
2     33.000
3     22.705
4     28.880
       ...
25    27.720
26    23.085
27    32.775
28    17.385
29    36.300
Name: bmi, Length: 30, dtype: float64

Ahora, miramos a ver cuál es el valor máximo de los 30 primeros valores de la columna bmi:

In [ ]:
bmi_30.max()

42.13

El valor obtenido es 42,13. El valor 53,13, pues, no está dentro de los 30 primeros valores. 
   
Vamos a indexar, ahora, no solo valores de una columna, sino filas y columnas  conjuntamente. Si queremos, por ejemplo, trabajar con las diez primeras filas y las dos  primeras columnas, ¿cómo lo hacemos? Necesitamos trabajar con el operador iloc y lo  haremos así:

In [ ]:
data_base_2 = data_base.iloc[0:10,0:2]

El que hemos hecho, aquí, es decir que queremos las diez primeras filas (0:10) y las dos  primeras columnas (0:2) de data_base. Hemos guardado esta tabla reducida en un nuevo  espacio de memoria, a través de un nombre nuevo que es data_base_2. Esto es un objeto  nuevo, una nueva base de datos. Si llamamos esta nueva base de datos, obtenemos:

In [ ]:
data_base_2

   age     sex
0   19  female
1   18    male
2   28    male
3   33    male
4   32    male
5   31  female
6   46  female
7   37  female
8   37    male
9   60  female

Podemos, también, en vez de seleccionar un intervalo de filas o columnas, seleccionar específicamente unas determinadas filas o columnas:

In [ ]:
data_base_3 = data_base.iloc[[0,5,6],[0,4]] 
data_base_3

   age smoker
0   19    yes
5   31     no
6   46     no

Lo que hemos hecho aquí es obtener las filas 0, 5 y 6 y las columnas 0 y 4. Después, las hemos  guardado como otra base de datos reducida en otro espacio de memoria.  
Para las columnas, podemos usar sus nombres propios para seleccionarlas. En este caso,  tenemos que usar el operador loc. Observemos este ejemplo:

In [ ]:
data_base_4 = data_base.loc[0:8,['children','age']] 
data_base_4

   children  age
0         0   19
1         1   18
2         3   28
3         0   33
4         0   32
5         0   31
6         1   46
7         3   37
8         2   37

Lo que hemos hecho es seleccionar las ocho primeras filas de las columnas children y age.  
 
Damos un paso adelante y vamos a crear tablas reducidas a partir de la tabla madre, no  haciendo uso de los índices de filas o columnas, sino de criterios condicionales. Imagina que  solo queremos aquellas observaciones que se encuentren en la región southwest. Este es el  código que necesitamos:

In [ ]:
data_base_southwest = data_base.loc[data_base.region == 'southwest']

Y queremos sacar, por pantalla, solo las siete primeras filas y las dos primeras columnas:

In [ ]:
data_base_southwest.iloc[0:7,0:2]

    age     sex
0    19  female
12   23    male
15   19    male
18   56    male
19   30    male
21   30  female
29   31    male

Fíjate que la numeración de filas hace referencia a las filas 0, 12, 15, 18, 19, 21 y 29, que son  las siete primeras filas que pertenecen en la región southwest de la tabla madre data_base. 
Si queremos ver aquellas observaciones de la base de datos principal que tengan un bmi entre 35 y 45, tendremos que declarar dos condicionales:

In [ ]:
data_base.loc[(data_base.bmi >= 35) & (data_base.bmi <= 45)].describe()

              age         bmi    children       charges
count  296.000000  296.000000  296.000000    296.000000
mean    41.679054   38.301976    1.027027  16913.681515
std     14.550498    2.427277    1.149479  15367.757351
min     18.000000   35.090000    0.000000   1141.445100
25%     30.000000   36.297500    0.000000   5745.351188
50%     43.500000   37.707500    1.000000  10979.853800
75%     54.000000   39.840000    2.000000  26781.395215
max     64.000000   44.880000    5.000000  58571.074480

Hemos aplicado la función describe(), para ver qué valores máximos y mínimos tiene la  columna bmi de esta tabla reducida: 

Efectivamente, vemos que, en esta tabla reducida, solo tenemos aquellas filas que tienen un  valor de bmi entre 35 y 45.  
Por último, vamos a crear una columna nueva. Sus valores dependerán del valor de bmi de  cada fila. El código es el siguiente:

In [ ]:
approved = []
for bmi in data_base['bmi']:
    if bmi < 45:
        approved.append(True)
    else:
        approved.append(False) 
data_base['approved'] = approved  
data_base.head()

   age     sex     bmi  children smoker     region      charges  approved
0   19  female  27.900         0    yes  southwest  16884.92400      True
1   18    male  33.770         1     no  southeast   1725.55230      True
2   28    male  33.000         3     no  southeast   4449.46200      True
3   33    male  22.705         0     no  northwest  21984.47061      True
4   32    male  28.880         0     no  northwest   3866.85520      True

Lo que estamos haciendo es dar un valor a cada fila de la columna approved de True o False,  según si el valor de bmi de la misma fila es superior o inferior a 45. Veamos los cinco primeros  registros con la nueva columna: